# .bashrc の読み込み
if [ -r "$HOME/.bashrc" ]; then
    . "$HOME/.bashrc"
fi

# ------------------------------------------------------------------------------
# システム全般
# ------------------------------------------------------------------------------

# Locale の設定
export LANG=ja_JP.UTF-8

# ------------------------------------------------------------------------------
# Homebrew
# ------------------------------------------------------------------------------

export PATH="/opt/homebrew/bin:/opt/homebrew/sbin:$PATH"

# ------------------------------------------------------------------------------
# Node.js
# ------------------------------------------------------------------------------

# NVM
export NVM_DIR="$HOME/.nvm"

[ -s "/opt/homebrew/opt/nvm/nvm.sh" ] &&
  . "/opt/homebrew/opt/nvm/nvm.sh"

[ -s "/opt/homebrew/opt/nvm/etc/bash_completion.d/nvm" ] &&
  . "/opt/homebrew/opt/nvm/etc/bash_completion.d/nvm"

# ------------------------------------------------------------------------------
# Ruby
# ------------------------------------------------------------------------------

eval "$(rbenv init - bash)"

# ------------------------------------------------------------------------------
# Rails
# ------------------------------------------------------------------------------

# 2023_03_19 rails new で失敗後、libpq を入れて
export LDFLAGS="-L/opt/homebrew/opt/libpq/lib"
export CPPFLAGS="-I/opt/homebrew/opt/libpq/include"
export PKG_CONFIG_PATH="/opt/homebrew/opt/libpq/lib/pkgconfig"
export PATH="/opt/homebrew/opt/libpq/bin:$PATH"

# ------------------------------------------------------------------------------
# Go
# ------------------------------------------------------------------------------

export PATH="$PATH:$HOME/go/bin"

# ------------------------------------------------------------------------------
# User commands
# ------------------------------------------------------------------------------

# ユーザー単位でインストールしたコマンド
export PATH="$PATH:$HOME/.local/bin"

# ↓ 未分類
